import numpy as np

def numberFromString(names):
    digit = [[] for _ in range(len(names))]
    for i, name in enumerate(names):
        for s in name:
            if s.isdigit():
                digit[i].append(s)
    digits = np.zeros(len(digit))
    for i, numbers in enumerate(digit):
        if numbers != []:
            length = len(numbers) - 1
            for n in numbers:
                digits[i] += pow(10, length) * int(float(n))
                length -= 1

    return [str(int(n)) for n in digits]

# names = ['1번카메라', '2번카메라', '3번카메라', '4번카메라', '김용관1', '  김용관2', '김용관3', '김용관4', '보은축사_1', '보은축사_2', '보은축사_3', '보은축사_4', '보은축사_5', '보은축사_6', '보은축사_7', '보은축사_8', '보은축사_9', '사리선진01', ' 사리선진02', '사리선진03', '사리선진04', '사리선진05', '사리선진06', '사리선진07', '사리선진08', '사리선진09', '사리선진10', '사리선진11', '사리선진12', '이천카길1', '이천카길2', '이천카길3', '이천카길4', '이천카길5', '이천카길6', '이천카길7', '남해-서대화1', '이충식1', '이충식2', '이충식3', '이충식4', '이충식5', '이충식6', '이충식7', '남해1', '남해2', '남해3', '남해4', '윤상희1', '윤상희2', '윤상희3', '윤상희4', '남해-서대화2', '남해-서대화3', '남해-서대화4', '남해-서대화5', '김낙현1', '김낙현2', '김낙현3', '김낙현4', '석경환1', '석경환2', '석경환3', '석경환4', '석경환5', '석경환6', '석경환7', '장귀섭1', '장귀섭2', '장귀섭3', '장귀섭4', '장귀섭5', '장귀섭6', '장귀섭7', '장귀섭8', '장귀섭9', '용준순1', '용준순2', '용준순3', '용준순4', '용준순5', '용준순6', '신재영1', '신재영7', '신재영6', '신재영8', '신재영5', '신재영3', '신재영2', '신재영4', '신재영9', '보은축사1', '보은축사2', '보은축사3', '보은축사4', '보은축사5', '보은축사6', '청송군이해찬사장님2', '청송군이해찬사장님3', '청송군이해찬사장님4', '청송군이해찬사장님5', '새말횡성2(강문수)', '새말횡성1(강문수)', '청송군이해찬사장님1', '신재영(집사람)01', '신재영(집사람)02', '신재영(집사람)03', '신재영(집사람)04', '신재영(집사람)05', '신재영(집사람)06', '신재영(집사람)07', '신재영(집사람)08', '신재영(집사람)09', '신재영(집사람)10', '신재영(집사람)11', '신재영(집사람)12', '신재영(집사람)13', '나형규1', '나형규2', '나형규3', '나형규4', '나형규5']
# print(numberFromString(names))
